"""
1.주석처리
     *한줄주석 : #
     *범위주석 : 범위지정후 => ctrl+ /
     *여러줄 주석처리 : ''' ~~~~~ '''
2. 출력
    print("출력하고 싶은말")
    print(변수명)
        * 1. 인덱싱 : [문자순서]
            print("안녕하세요"[0] )
        * 2. 슬라이싱 : [ 시작번호 : 끝번호전까지 ]
            print("안녕하세요"[ 0 : 2 ]
3. 입력
    input("입력받기전 출력문") : 키보드에서 문자열 가져오기
    int( input() )  : 문자열 => 숫자열 입력받기
        * int("문자열") : 숫자열변환 함수
4. 변수
    메모리할당[자동]받아 데이터를 저장하는 공간
    * 변수 선언 [ 초기값 ]
        변수명 = 값
        변수명 규칙 : 1.특수문자x 2.숫자로시작x 3.공백x 4.대소문자 구별 5.키워드x
    * 변수 호출
        변수명
    * 변수는 메모리[자원] 할당 받기 때문에 효율적으로 사용

5. 연산자
    1. 산술연산자
    2. 비교연산자
    3. 논리연산자
    4. 대입연산자


"""