'''
    DAY01 : 출력
    DAY02 : 입력 , 변수 , 연산자
    DAY03 : 제어문 IF
    DAY04 : 반복문 FOR while
    Day05 : 리스트
    day06 : 리스트 활용
    day07 : 함수
    day08 : 딕셔너리
    day09 : 클래스
    day10 : 파일
    # https://wikidocs.net/book/922
------------------------------------------
    day11 : 예외처리
    day12 : csv 파일 다루기
    day13 : 크롤링
    day14(17) : API
    day15(19) : API
    day16(20) : 알고리즘
    day17(24) : 알고리즘
    day18(26) : 알고리즘
    day19(27) : 알고리즘
    day20(31) : 알고리즘
         [공지]
'''




"""
1.주석처리
     *한줄주석 : #
     *범위주석 : 범위지정후 => ctrl+ /
     *여러줄 주석처리 : ''' ~~~~~ '''
2. 출력
    print("출력하고 싶은말")
    print(변수명)
        * 1. 인덱싱 : [문자순서]
            print("안녕하세요"[0] )
        * 2. 슬라이싱 : [ 시작번호 : 끝번호전까지 ]
            print("안녕하세요"[ 0 : 2 ]
3. 입력
    input("입력받기전 출력문") : 키보드에서 문자열 가져오기
    int( input() )  : 문자열 => 숫자열 입력받기
        * int("문자열") : 숫자열변환 함수
4. 변수
    메모리할당[자동]받아 데이터를 저장하는 공간
    * 변수 선언 [ 초기값 ]
        변수명 = 값
        변수명 규칙 : 1.특수문자x 2.숫자로시작x 3.공백x 4.대소문자 구별 5.키워드x
    * 변수 호출
        변수명
    * 변수는 메모리[자원] 할당 받기 때문에 효율적으로 사용

5. 연산자
    1. 산술연산자
    2. 비교연산자
    3. 논리연산자
    4. 대입연산자

6. 제어문 if
    if 논리연산자 :
        [t] 실행문
    else :
        [f] 실행문

7. 반복문 for
    for 매개변수 in range( 시작 , 끝 , 증가단위 ) :
        반복실행코드


"""

