
#별찍기1 :
'''         i = 현재줄     s = 별
	*       i=1         s = 1
	**      i=2         s = 1 2
	***     i=3         s = 1 2 3
	****    i=4         s = 1 2 3 4
	*****   i=5         s = 1 2 3 4 5
	공식    i는1씩증가    s는 1부터 i까지
'''
줄 = int(input("줄수 : "))
for i in range( 1 , 줄+1 ) : # i는 1부터 줄+1 까지 1씩 증가
    for s in range( 1 , i+1 ) : # s는 1부터 i[현재줄수]+1까지 1씩 증가
        print("★" , end="") # 별 출력
    print() # i 마다 줄바꿈

#별찍기2 :
'''             i = 현재줄수     s = 별 
	*****       i = 1           s = 1 2 3 4 5       5-1 = 4+1 = 5
	****        i = 2           s = 1 2 3 4         5-2 = 3+1 = 4
	***         i = 3           s = 1 2 3           5-3 = 2+1 = 3
	**          i = 4           s = 1 2             5-4 = 1+1 = 2 
	*           i = 5           s = 1               5-5 = 0+1 = 1 
	공식        i는1씩증가        최대줄수 - 현재줄수 +1
'''
줄 = int(input("줄수 : "))
for i in range( 1 , 줄+1 ) :
    for s in range( 1 , 줄-i+1+1 ) :
        print("★" , end="") # 별 출력
    print()  # i 마다 줄바꿈
#별찍기3 :
'''         i = 현재줄       b = 공백                        s = 별
    *       i = 1           b = 1 2 3 4     5-1 = 4         s = 1 
   **       i = 2           b = 1 2 3       5-2 = 3         s = 1 2
  ***       i = 3           b = 1 2         5-3 = 2         s = 1 2 3 
 ****       i = 4           b = 1           5-4 = 1         s = 1 2 3 4
*****       i = 5           b =             5-5 = 0         s = 1 2 3 4 5
공식                         최대줄수-현재줄수                s 는 i까지 
'''
줄 = int(input("줄수 : "))
for i in range( 1 , 줄+1 ) :
    #공백찍기
    for b in range( 1 , 줄-i+1 ) :
        print(" " , end="")
    #별찍기
    for s in range( 1 , i+1 ) :
        print("*" , end="")
    print()  # i 마다 줄바꿈
#별찍기4 :
'''             i = 
    *****       i = 1       b =             s = 1 2 3 4 5 
     ****       i = 2       b = 1           s = 1 2 3 4
      ***       i = 3       b = 1 2         s = 1 2 3
       **       i = 4       b = 1 2 3       s = 1 2
        *       i = 5       b = 1 2 3 4     s = 1
        공식                 b는 현재줄수-1   s는 최대줄수-현재줄수+1
'''
줄 = int(input("줄수 : "))
for i in range( 1 , 줄+1 ) :
    # 공백
    for b in range( 1 , i-1+1 ) :
        print(" " , end="")
    # 별
    for s in range( 1 , 줄-i+1+1 ) :
        print("*" , end="")
    # 줄바꿈
    print()
#별찍기5 :
'''
        *       i = 1      b = 1 2 3 4      s = 1                   1 * 2 = 2-1 = 1
       ***      i = 2      b = 1 2 3        s = 1 2 3               2 * 2 = 4-1 = 3
      *****     i = 3      b = 1 2          s = 1 2 3 4 5           3 * 2 = 6-1 = 5
     *******    i = 4      b = 1            s = 1 2 3 4 5 6 7       4 * 2 = 8-1 = 7
    *********   i = 5      b =              s = 1 2 3 4 5 6 7 8 9   5 * 2 = 10-1 = 9
                          최대줄수-현재줄수     i * 2 -1 
'''
줄 = int(input("줄수 : "))
for i in range( 1 , 줄+1 ) :
    # 공백찍기
    for b in range( 1 , 줄-i+1) :
        print(" " , end="")
    # 별찍기
    for s in range( 1, i*2-1+1 ) :
        print("*" , end="")
    # 줄바꿈
    print()










